; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	infrared2 - mode
	infrared1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	Star6 - direction
	GroundStation2 - direction
	Star4 - direction
	Star5 - direction
	Star3 - direction
	GroundStation7 - direction
	GroundStation8 - direction
	Star9 - direction
	Phenomenon10 - direction
	Planet11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Phenomenon16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 GroundStation2)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 infrared1)
	(supports instrument1 infrared2)
	(supports instrument1 spectrograph0)
	(calibration_target instrument1 GroundStation8)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star4)
	(supports instrument3 infrared2)
	(supports instrument3 infrared1)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 GroundStation7)
	(calibration_target instrument3 Star3)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star0)
)
(:goal (and
	(have_image Star9 infrared1)
	(have_image Phenomenon10 spectrograph0)
	(have_image Planet11 infrared1)
	(have_image Star12 infrared2)
	(have_image Phenomenon13 infrared2)
	(have_image Phenomenon14 infrared1)
	(have_image Star15 infrared2)
	(have_image Phenomenon16 infrared1)
	(have_image Star17 infrared2)
))

)

; plan
1. (turn_to satellite1 groundstation8 star0)
   deleted: (pointing satellite1 star0)
   added: (pointing satellite1 groundstation8)
   goals met: 0 of 9
2. (switch_on instrument1 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument1)
   goals met: 0 of 9
3. (calibrate satellite1 instrument1 groundstation8)
   added: (calibrated instrument1)
   goals met: 0 of 9
4. (turn_to satellite1 phenomenon14 groundstation8)
   deleted: (pointing satellite1 groundstation8)
   added: (pointing satellite1 phenomenon14)
   goals met: 0 of 9
5. (take_image satellite1 phenomenon14 instrument1 infrared1)
   added: (have_image phenomenon14 infrared1)
   goals met: 1 of 9
6. (turn_to satellite1 phenomenon13 phenomenon14)
   deleted: (pointing satellite1 phenomenon14)
   added: (pointing satellite1 phenomenon13)
   goals met: 1 of 9
7. (take_image satellite1 phenomenon13 instrument1 infrared2)
   added: (have_image phenomenon13 infrared2)
   goals met: 2 of 9
8. (turn_to satellite1 phenomenon10 phenomenon13)
   deleted: (pointing satellite1 phenomenon13)
   added: (pointing satellite1 phenomenon10)
   goals met: 2 of 9
9. (take_image satellite1 phenomenon10 instrument1 spectrograph0)
   added: (have_image phenomenon10 spectrograph0)
   goals met: 3 of 9
10. (turn_to satellite1 phenomenon16 phenomenon10)
   deleted: (pointing satellite1 phenomenon10)
   added: (pointing satellite1 phenomenon16)
   goals met: 3 of 9
11. (take_image satellite1 phenomenon16 instrument1 infrared1)
   added: (have_image phenomenon16 infrared1)
   goals met: 4 of 9
12. (turn_to satellite1 planet11 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet11)
   goals met: 4 of 9
13. (take_image satellite1 planet11 instrument1 infrared1)
   added: (have_image planet11 infrared1)
   goals met: 5 of 9
14. (turn_to satellite1 star12 planet11)
   deleted: (pointing satellite1 planet11)
   added: (pointing satellite1 star12)
   goals met: 5 of 9
15. (take_image satellite1 star12 instrument1 infrared2)
   added: (have_image star12 infrared2)
   goals met: 6 of 9
16. (turn_to satellite1 star15 star12)
   deleted: (pointing satellite1 star12)
   added: (pointing satellite1 star15)
   goals met: 6 of 9
17. (take_image satellite1 star15 instrument1 infrared2)
   added: (have_image star15 infrared2)
   goals met: 7 of 9
18. (turn_to satellite1 star17 star15)
   deleted: (pointing satellite1 star15)
   added: (pointing satellite1 star17)
   goals met: 7 of 9
19. (take_image satellite1 star17 instrument1 infrared2)
   added: (have_image star17 infrared2)
   goals met: 8 of 9
20. (turn_to satellite1 star9 star17)
   deleted: (pointing satellite1 star17)
   added: (pointing satellite1 star9)
   goals met: 8 of 9
21. (take_image satellite1 star9 instrument1 infrared1)
   added: (have_image star9 infrared1)
   goals met: 9 of 9
